package cn.lingjiatong.re.service.sys.mapper;

import cn.lingjiatong.re.common.entity.Role;
import com.baomidou.mybatisplus.core.mapper.BaseMapper;

/**
 * 角色模块mapper层
 *
 * @author Ling, Jiatong
 * Date: 2023/3/3 14:55
 */
public interface RoleMapper extends BaseMapper<Role> {
    // ********************************新增类接口********************************
    // ********************************删除类接口********************************
    // ********************************修改类接口********************************
    // ********************************查询类接口********************************
    // ********************************私有函数********************************
    // ********************************公用函数********************************
}
